In [1]:
import pandas as pd

In [2]:
l_1 = [[1,2,3],[4,5,6]]
idx = ["a","b"]
col = ["x1","x2","x3"]
data_1 = pd.DataFrame(data=l_1, index=idx, columns=col)
data_1

   x1  x2  x3
a   1   2   3
b   4   5   6

In [3]:
data_1["x1"]

a    1
b    4
Name: x1, dtype: int64

In [4]:
data_1.iloc[0]

x1    1
x2    2
x3    3
Name: a, dtype: int64

In [5]:
data_1.loc["a"]

x1    1
x2    2
x3    3
Name: a, dtype: int64

In [6]:
data_1.loc["a"]["x1"] = 99
data_1

   x1  x2  x3
a  99   2   3
b   4   5   6

In [7]:
data_1.index = ["c","b"]
data_1

   x1  x2  x3
c  99   2   3
b   4   5   6

In [8]:
data_1.loc["e"] = [10,11,12]
data_1

   x1  x2  x3
c  99   2   3
b   4   5   6
e  10  11  12

In [9]:
l_1 = [[1,2,3],[4,5,6]]
idx = ["j","k"]
col = ["x1","x2","x3"]
data_2 = pd.DataFrame(data=l_1, index=idx, columns=col)
data_2

   x1  x2  x3
j   1   2   3
k   4   5   6

In [10]:
data_3 = pd.concat([data_1,data_2])
data_3

   x1  x2  x3
c  99   2   3
b   4   5   6
e  10  11  12
j   1   2   3
k   4   5   6

In [11]:
data_3 = pd.concat([data_1,data_2], axis=0)
data_3

   x1  x2  x3
c  99   2   3
b   4   5   6
e  10  11  12
j   1   2   3
k   4   5   6

In [12]:
data_2["z4"] = [32,42]
data_2

   x1  x2  x3  z4
j   1   2   3  32
k   4   5   6  42

In [15]:
data_4 = pd.DataFrame([[10,11],[12,12]], index=["k","j"], columns=["y5","y6"])
data_4

   y5  y6
k  10  11
j  12  12

In [16]:
data_5 = pd.concat([data_2,data_4], axis=1)
data_5

   x1  x2  x3  z4  y5  y6
j   1   2   3  32  12  12
k   4   5   6  42  10  11

In [17]:
data_5.drop(["j"], axis=0, inplace=True)
data_5

   x1  x2  x3  z4  y5  y6
k   4   5   6  42  10  11

In [18]:
del data_5["z4"]
data_5

   x1  x2  x3  y5  y6
k   4   5   6  10  11

In [19]:
data_5.drop(["x1","x2","x3"], axis=1, inplace=True)
data_5

   y5  y6
k  10  11